[Killed] BlockStatement
src/index.ts:1:49
-export function capitalize(str: string): string {
-  return str ? str.charAt(0).toUpperCase() + str.slice(1) : str;
-}
+export function capitalize(str: string): string {}
 
 export function isDefined<T>(value: T | null | undefined): value is T {
killedBy: All tests
statusReason: > @cc-wrapper/shared-utils@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/index.test.ts:

[Killed] MethodExpression
src/index.ts:2:16
 export function capitalize(str: string): string {
-  return str ? str.charAt(0).toUpperCase() + str.slice(1) : str;
+  return str ? str.charAt(0).toLowerCase() + str.slice(1) : str;
 }
 
killedBy: All tests
statusReason: > @cc-wrapper/shared-utils@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/index.test.ts:

[Killed] ArithmeticOperator
src/index.ts:2:16
 export function capitalize(str: string): string {
-  return str ? str.charAt(0).toUpperCase() + str.slice(1) : str;
+  return str ? str.charAt(0).toUpperCase() - str.slice(1) : str;
 }
 
killedBy: All tests
statusReason: > @cc-wrapper/shared-utils@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/index.test.ts:

[Killed] BlockStatement
src/index.ts:5:71
   return str ? str.charAt(0).toUpperCase() + str.slice(1) : str;
 }
 
-export function isDefined<T>(value: T | null | undefined): value is T {
-  return value !== null && value !== undefined;
-}
+export function isDefined<T>(value: T | null | undefined): value is T {}
 
killedBy: All tests
statusReason: > @cc-wrapper/shared-utils@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/index.test.ts:

[Killed] ConditionalExpression
src/index.ts:6:10
 }
 
 export function isDefined<T>(value: T | null | undefined): value is T {
-  return value !== null && value !== undefined;
+  return false;
 }
 
killedBy: All tests
statusReason: > @cc-wrapper/shared-utils@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/index.test.ts:

[Killed] EqualityOperator
src/index.ts:6:10
 }
 
 export function isDefined<T>(value: T | null | undefined): value is T {
-  return value !== null && value !== undefined;
+  return value === null && value !== undefined;
 }
 
killedBy: All tests
statusReason: > @cc-wrapper/shared-utils@0.1.0 test
> bun test


bun test v1.3.0 (b0a6feca)


tests/index.test.ts:
